# Pandas

## 자료구조 : Seires와 Dataframe

Pandas에서 제공하는 데이터 자료구조는 Series와 Dataframe 두가지가 존재하는데 Series는 시계열과 유사한 데이터로서 index와 value가 존재하고 Dataframe은 딕셔너리데이터를 매트릭스 형태로 만들어 준 것 같은 frame을 가지고 있다. 이런 데이터 구조를 통해 시계열, 비시계열 데이터를 통합하여 다룰 수 있다.

In [1]:
import pandas

In [2]:
# !pip install pandas # 터미널 환경에서 하는 것같은 효과

# Series

In [3]:
from pandas import Series, DataFrame
import pandas as pd

In [4]:
fruit = Series([2500, 3800, 1200, 6000], index=['apple','banana','peer','cherry'])

In [5]:
fruit

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [6]:
print(fruit.values)

[2500 3800 1200 6000]

In [7]:
print(fruit.index)

Index(['apple', 'banana', 'peer', 'cherry'], dtype='object')

Series의 형태는 Dictionary와 매우 유사하나 key가 index로 바뀐 정도가 아니라 데이터 구조 자체가 매우 다릅니다.

In [8]:
fruitData = {'apple': 2500, 'banana': 3800, 'peer': 1200, 'cherry': 6000}

In [9]:
fruit = Series(fruitData)

In [10]:
print(type(fruitData), type(fruit))

<class 'dict'> <class 'pandas.core.series.Series'>

In [11]:
fruit.name = 'fruitPrice'

In [12]:
fruit.index.name = 'fruitName'

In [13]:
fruit

fruitName
apple     2500
banana    3800
peer      1200
cherry    6000
Name: fruitPrice, dtype: int64

In [14]:
fruitData = {'fruitName': ['apple', 'banana', 'peer', 'cherry'], 'fruitPrice': [2500, 3800, 1200, 6000], 'num': [10, 5, 8, 3]}

In [15]:
type(fruitData)

dict

In [16]:
fruitFrame = DataFrame(fruitData)

In [17]:
fruitFrame

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2      peer        1200    8
3    cherry        6000    3

In [18]:
type(fruitFrame)

pandas.core.frame.DataFrame

In [19]:
fruitFrame = DataFrame(fruitData, columns=['fruitPrice', 'num', 'fruitName']) # 정렬할 열 순서 위치 조정 가능

In [20]:
fruitFrame

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        1200    8      peer
3        6000    3    cherry

In [21]:
fruitFrame['fruitName']

0     apple
1    banana
2      peer
3    cherry
Name: fruitName, dtype: object

In [22]:
fruitFrame.fruitName

0     apple
1    banana
2      peer
3    cherry
Name: fruitName, dtype: object

In [23]:
type(fruitFrame.fruitName)

pandas.core.series.Series

In [24]:
fruitFrame

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        1200    8      peer
3        6000    3    cherry

In [25]:
fruitFrame['Year']= 2021

In [26]:
fruitFrame

   fruitPrice  num fruitName  Year
0        2500   10     apple  2021
1        3800    5    banana  2021
2        1200    8      peer  2021
3        6000    3    cherry  2021

In [27]:
variable = Series([4, 2, 1], [0, 2, 3])

In [28]:
fruitFrame['stock'] = variable

In [29]:
print(fruitFrame)

   fruitPrice  num fruitName  Year  stock
0        2500   10     apple  2021    4.0
1        3800    5    banana  2021    NaN
2        1200    8      peer  2021    2.0
3        6000    3    cherry  2021    1.0

In [30]:
fruit = Series([2500, 3800, 1200, 6000], index=['apple', 'banana', 'peer', 'cherry'])

In [31]:
new_fruit = fruit.drop('banana')

In [32]:
fruitData = {
    'fruitName': ['apple', 'banana', 'cherry', 'peer'],
    'fruitPrice': [2500, 3800, 6000, 1200],
    'num': [10, 5, 3, 8]
}

In [33]:
fruitName = fruitData['fruitName']

In [34]:
fruitFrame = DataFrame(fruitData, index=fruitName, columns=['fruitPrice', 'num'])

In [35]:
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [36]:
fruitFrame2 = fruitFrame.drop(['apple', 'cherry'])

In [37]:
fruitFrame2

        fruitPrice  num
banana        3800    5
peer          1200    8

In [38]:
fruitFrame3 = fruitFrame.drop('num', axis=1)

In [39]:
fruitFrame3

        fruitPrice
apple         2500
banana        3800
cherry        6000
peer          1200

In [40]:
fruitFrame # 차이 비교

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [41]:
fruit = Series([2500, 3800, 1200, 6000], index=['apple', 'banana', 'peer', 'cherry'])

In [42]:
fruit

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [43]:
fruit['apple': 'peer'] # 배열 슬라이싱할 때랑 범위가 살짝 다름

apple     2500
banana    3800
peer      1200
dtype: int64

In [44]:
fruitData = {
    'fruitName': ['apple', 'banana', 'cherry', 'peer'],
    'fruitPrice': [2500, 3800, 6000, 1200],
    'num': [10, 5, 3, 8]
}

In [45]:
fruitName = fruitData['fruitName']

In [46]:
fruitFrame = DataFrame(fruitData, index=fruitName, columns=['fruitPrice', 'num'])

In [47]:
print(fruitFrame)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [48]:
fruitFrame['fruitPrice']

apple     2500
banana    3800
cherry    6000
peer      1200
Name: fruitPrice, dtype: int64

In [49]:
fruitFrame['apple': 'banana']

        fruitPrice  num
apple         2500   10
banana        3800    5

# 데이터의 기본연산

In [50]:
fruit1 = Series([5,9,10,3], index=['apple', 'banana', 'cherry', 'peer'])

In [51]:
fruit2 = Series([5,2,9,5,10], index=['apple', 'orange', 'banana', 'cherry', 'mango'])

In [52]:
fruit1 + fruit2 # 공통적으로 존재하지 않는 데이터는 연산결과 NaN

apple     10.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
peer       NaN
dtype: float64

In [53]:
fruitData1 = {'Ohio': [4, 8, 3, 5], 'Texas': [0, 1, 2, 3]}
fruitFrame1 = DataFrame(fruitData1, columns=['Ohio','Texas'], index=['apple','banana','cherry','peer'])

In [54]:
fruitData2 = {'Ohio': [3, 0, 2, 1, 7], 'Colorado': [5, 4, 3, 6, 0]}
fruitFrame2 = DataFrame(fruitData2, columns=['Ohio','Colorado'], index=['apple','orange','banana','cherry', 'mango'])

In [55]:
print(fruitFrame1)

        Ohio  Texas
apple      4      0
banana     8      1
cherry     3      2
peer       5      3

In [56]:
print(fruitFrame2)

        Ohio  Colorado
apple      3         5
orange     0         4
banana     2         3
cherry     1         6
mango      7         0

In [57]:
fruitFrame1 + fruitFrame2

        Colorado  Ohio  Texas
apple        NaN   7.0    NaN
banana       NaN  10.0    NaN
cherry       NaN   4.0    NaN
mango        NaN   NaN    NaN
orange       NaN   NaN    NaN
peer         NaN   NaN    NaN

# 데이터의 정렬

In [58]:
fruit = Series([2500, 3800, 1200, 6000], index=['apple','banana','peer','cherry'])

In [59]:
fruit

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [60]:
fruit.sort_values()

peer      1200
apple     2500
banana    3800
cherry    6000
dtype: int64

In [61]:
fruit.sort_values(ascending=False)

cherry    6000
banana    3800
apple     2500
peer      1200
dtype: int64

In [62]:
fruitData = {
    'fruitName':['peer','banana','apple','cherry'],
    'fruitPrice':[2500,3800,6000,1200],
    'num':[10,5,3,8]
}

In [63]:
fruitName = fruitData['fruitName']

In [64]:
fruitFrame = DataFrame(fruitData, index=fruitName, columns=['num', 'fruitPrice'])

In [66]:
print(fruitFrame)

        num  fruitPrice
peer     10        2500
banana    5        3800
apple     3        6000
cherry    8        1200

In [68]:
fruitFrame.sort_index()

        num  fruitPrice
apple     3        6000
banana    5        3800
cherry    8        1200
peer     10        2500

In [69]:
fruitFrame.sort_index(axis=1)

        fruitPrice  num
peer          2500   10
banana        3800    5
apple         6000    3
cherry        1200    8

In [71]:
fruitFrame.sort_values(by=['fruitPrice', 'num'])

        num  fruitPrice
cherry    8        1200
peer     10        2500
banana    5        3800
apple     3        6000

## 기초분석

Pandas는 데이터를 구조적인 측면에서 좀 더 편하게 다룰 수 있게 하는 장점을 모아서 만든 패키지로 Pandas에서 제공하는 통계 분석은 기술 통계 및 데이터 요약이다. 고급 통계 기법은 scikit-learn이나 다른 통계 패키지를 이용하여 수행 할 수 있다.

![기술통계량](images/numpy-5.png)

In [72]:
german = pd.read_csv('http://freakonometrics.free.fr/german_credit.csv')

In [73]:
list(german.columns.values)

['Creditability',
 'Account Balance',
 'Duration of Credit (month)',
 'Payment Status of Previous Credit',
 'Purpose',
 'Credit Amount',
 'Value Savings/Stocks',
 'Length of current employment',
 'Instalment per cent',
 'Sex & Marital Status',
 'Guarantors',
 'Duration in Current address',
 'Most valuable available asset',
 'Age (years)',
 'Concurrent Credits',
 'Type of apartment',
 'No of Credits at this Bank',
 'Occupation',
 'No of dependents',
 'Telephone',
 'Foreign Worker']

In [74]:
german_sample = german[['Creditability','Duration of Credit (month)','Purpose','Credit Amount']]

In [75]:
german_sample

     Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]

In [76]:
german_sample.min()

Creditability                   0
Duration of Credit (month)      4
Purpose                         0
Credit Amount                 250
dtype: int64

In [78]:
german_sample.max()

Creditability                     1
Duration of Credit (month)       72
Purpose                          10
Credit Amount                 18424
dtype: int64

In [79]:
german_sample.mean() # 평균

Creditability                    0.700
Duration of Credit (month)      20.903
Purpose                          2.828
Credit Amount                 3271.248
dtype: float64

In [81]:
german_sample.describe()

       Creditability  Duration of Credit (month)      Purpose  Credit Amount
count    1000.000000                 1000.000000  1000.000000     1000.00000
mean        0.700000                   20.903000     2.828000     3271.24800
std         0.458487                   12.058814     2.744439     2822.75176
min         0.000000                    4.000000     0.000000      250.00000
25%         0.000000                   12.000000     1.000000     1365.50000
50%         1.000000                   18.000000     2.000000     2319.50000
75%         1.000000                   24.000000     3.000000     3972.25000
max         1.000000                   72.000000    10.000000    18424.00000

## 상관관계와 공분산

공분산(Covariance) : X의 편차와 Y의 편차를 곱한 것의 평균, X와 Y의 단위에 영향을 받는다.

상관계수(Correlation) : 확률변수의 절대적 크기에 영향을 받지 않도록 단위화, 분산의 크기만큼 나눔

In [82]:
german_sample = german[['Duration of Credit (month)','Credit Amount','Age (years)']]

In [83]:
german_sample.head()

   Duration of Credit (month)  Credit Amount  Age (years)
0                          18           1049           21
1                           9           2799           36
2                          12            841           23
3                          12           2122           39
4                          12           2171           38

In [84]:
german_sample.corr() # 상관계수. 좀 더 많이 활용함

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),1.000000,0.624988,-0.037550
Credit Amount,0.624988,1.000000,0.032273
Age (years),-0.037550,0.032273,1.000000

In [85]:
german_sample.cov() # 공분산

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),145.415006,2.127401e+04,-5.140567
Credit Amount,21274.007063,7.967927e+06,1034.202787
Age (years),-5.140567,1.034203e+03,128.883119